---
kind: enumMember
id: F:Autodesk.Revit.DB.TemporaryViewMode.PreviewFamilyVisibility
enum: Autodesk.Revit.DB.TemporaryViewMode
source: html/8c0c72db-2801-3642-72bb-108cfdff23e1.htm
---
# Autodesk.Revit.DB.TemporaryViewMode.PreviewFamilyVisibility

The view is in the mode that shows visibility settings applied in the environment of a family document.